**Homework untuk materi : Basic Statistics** 

Dalam homework ini, anda akan diminta melakukan descriptive statistics terhadap dataset yang diberikan. Dataset :  
https://archive.ics.uci.edu/ml/datasets/bank+marketing 

• Silakan download file di link Data Folder : https://archive.ics.uci.edu/ml/machine-learning databases/00222/ 

• Download file bank-additional.zip

• Dataset yang dianalisis adalah : bank-additional.csv

**Instruksi :**  
1. Ambil 3 tipe kolom numeric dan 3 tipe kolom categorical, pilihan terserah Anda. 
2. Kategorikan pilihan anda ke dalam : Nominal, Ordinal, Interval, atau Ratio 
3. Terhadap ke-enam kolom tersebut, lakukan descriptive statistics, dan bentuknya tabel sebagai  berikut :

4. Gunakan Python, Pandas, Numpy, atau library lain untuk membentuk tabel di atas. Plus point  apabila rekan-rekan bisa langsung membentuk tabelnya melalui Python, namun apabila tidak,  teman-teman bisa membentuk tabel itu di Excel (formatnya), tapi value-nya harus dicari dengan  menggunakan Python.

     a. Apabila metric Mean/Median/dsb tidak applicable untuk tipe yang anda cari, mohon  dapat dikosongi saja.
 
 
5. Lampirkan jawaban anda dalam file PDF dan Jupyter Notebook.

**JAWAB :**

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data_bank = pd.read_csv(r"D:\M Arif\Digital School\WEEK 8\Session 22\bank-additional\bank-additional\bank-additional.csv", delimiter = ';')

In [4]:
data_bank.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,...,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39,services,single,high.school,no,no,no,telephone,may,fri,...,4,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no
2,25,services,married,high.school,no,yes,no,telephone,jun,wed,...,1,999,0,nonexistent,1.4,94.465,-41.8,4.962,5228.1,no
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,fri,...,3,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,mon,...,1,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no

In [5]:
data_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4119 entries, 0 to 4118
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             4119 non-null   int64
 1   job             4119 non-null   object
 2   marital         4119 non-null   object
 3   education       4119 non-null   object
 4   default         4119 non-null   object
 5   housing         4119 non-null   object
 6   loan            4119 non-null   object
 7   contact         4119 non-null   object
 8   month           4119 non-null   object
 9   day_of_week     4119 non-null   object
 10  duration        4119 non-null   int64
 11  campaign        4119 non-null   int64
 12  pdays           4119 non-null   int64
 13  previous        4119 non-null   int64
 14  poutcome        4119 non-null   object
 15  emp.var.rate    4119 non-null   float64
 16  cons.price.idx  4119 non-null   float64
 17  cons.conf.idx   4119 non-null   float64
 18  euribor3m       4119 non-null   float64
 19  nr.employed     4119 non-null   float64
 20  y               4119 non-null   object
dtypes: float64(5), int64(5), object(11)
memory usage: 675.9+ KB

**1. Memilih Kolom**

pilihan kolom yang akan dicari value: 
1. age : numerical (ratio)
2. job : kategorical (nominal)
3. education: kategori (ordinal)
4. contact : kategorikal (nominal)
5. cons.price.idx : numerical (ratio)
6. cons.conf.idx : numerical (interval)

* Membuat variable baru pada pilihan kolom untuk mempermudah dalam mencari value yang diinginkan

In [6]:
d1 = data_bank [['age']]

In [7]:
d2 = data_bank [['job']]

In [8]:
d3 = data_bank [['education']]

In [9]:
d4 = data_bank [['contact']]

In [10]:
d5 = data_bank [['cons.price.idx']]

In [11]:
d6 = data_bank [['cons.conf.idx']]

In [12]:
data_opsi = pd.concat([d1,d2,d3,d4,d5,d6], axis=1)

In [13]:
data_opsi

,age,job,education,contact,cons.price.idx,cons.conf.idx
0,30,blue-collar,basic.9y,cellular,92.893,-46.2
1,39,services,high.school,telephone,93.994,-36.4
2,25,services,high.school,telephone,94.465,-41.8
3,38,services,basic.9y,telephone,94.465,-41.8
4,47,admin.,university.degree,cellular,93.200,-42.0
...,...,...,...,...,...,...
4114,30,admin.,basic.6y,cellular,93.918,-42.7
4115,39,admin.,high.school,telephone,93.918,-42.7
4116,27,student,high.school,cellular,92.893,-46.2
4117,58,admin.,high.school,cellular,93.444,-36.1
4118,34,management,high.school,cellular,93.200,-42.0

In [85]:
bank1 = pd.DataFrame({
                     'nama_kolom': [], 
                     'Mean' : [], 
                     'Median' : [], 
                     'Mode' : [], 
                     '75%_Percentile' : [],
                     '90%_Percentile' : [], 
                     'Standar_Deviation' : [],
                     'Inter_quartile_range' : []
                     })

In [86]:
bank

Empty DataFrame
Columns: [nama_kolom, Mean, Median, Mode, 75%_Percentile, 90%_Percentile, Standar_Deviation, Inter_quartile_range]
Index: []

**Mencari Value yang diinginkan sesuai feature yang telah dipilih**

* Kolom Mean

In [14]:
Mean = data_opsi.mean()

In [15]:
Mean

age               40.113620
cons.price.idx    93.579704
cons.conf.idx    -40.499102
dtype: float64

* Kolom Median

In [16]:
Median = data_opsi.median()

In [17]:
Median

age               38.000
cons.price.idx    93.749
cons.conf.idx    -41.800
dtype: float64

* Kolom Mode

In [18]:
Mode = data_opsi.mode()

In [19]:
Mode

   age     job          education   contact  cons.price.idx  cons.conf.idx
0   32  admin.  university.degree  cellular          93.994          -36.4

In [20]:
data_opsi.describe()

               age  cons.price.idx  cons.conf.idx
count  4119.000000     4119.000000    4119.000000
mean     40.113620       93.579704     -40.499102
std      10.313362        0.579349       4.594578
min      18.000000       92.201000     -50.800000
25%      32.000000       93.075000     -42.700000
50%      38.000000       93.749000     -41.800000
75%      47.000000       93.994000     -36.400000
max      88.000000       94.767000     -26.900000

* Kolom 75% Percentile dan 90% Percentile

In [22]:
np.percentile (data_opsi['age'], 75)

47.0

In [23]:
np.percentile (data_opsi['age'], 90)

55.0

In [25]:
np.percentile (data_opsi['cons.price.idx'], 75)

93.994

In [27]:
np.percentile (data_opsi['cons.price.idx'], 90)

94.465

In [28]:
np.percentile (data_opsi['cons.conf.idx'], 75)

-36.4

In [29]:
np.percentile (data_opsi['cons.conf.idx'], 90)

-36.1

* Kolom Inter_quartile_range

In [40]:
q25, q75 = np.nanpercentile(data_opsi['age'], [25,75])

In [42]:
q25, q75

(32.0, 47.0)

In [41]:
(q75-q25)

15.0

In [43]:
q25, q75 = np.nanpercentile (data_opsi['cons.price.idx'], [25, 75])

In [45]:
q25, q75

(93.075, 93.994)

In [44]:
(q75-q25)

0.9189999999999969

In [46]:
q25, q75 = np.nanpercentile(data_opsi['cons.conf.idx'], [25, 75])

In [47]:
q25, q75

(-42.7, -36.4)

In [49]:
(q75-q25)

6.300000000000004

* Kolom Standar Deviation

In [36]:
data_opsi.std()

age               10.313362
cons.price.idx     0.579349
cons.conf.idx      4.594578
dtype: float64

In [37]:
data_opsi['age'].std()

10.313361547199822

In [38]:
data_opsi['cons.price.idx'].std()

0.5793488049889657

In [39]:
data_opsi['cons.conf.idx'].std()

4.594577506837506

**Input seluruh value terhadap feature yang dipilih berdasarkan hasil yang telah diperoleh**
* Membuat Dataframe terhadap hasil yang diperoleh. 
* Diasumsikan bahwa nilai 'NaN' merupakan nilai yang tidak dapat dihitung menggunakan metode pencarian value yang diinginkan.

In [93]:
bank = pd.DataFrame({
                     'nama_kolom': ['age', 'job', 'education',
                                    'contact', 'cons.price.idx', 'cons.conf.idx'], 
                     'Mean' : [40.11,'NaN','NaN', 'NaN', 93.57, -40.49], 
                     'Median' : [38.00, 'NaN', 'NaN', 'NaN', 93.74, -41.80], 
                     'Mode' : [32,'admin.', 'university.degree', 'cellular', 93.99, -36.40], 
                     '75%_Percentile' : [47.0, 'NaN', 'NaN', 'NaN', 93.99, -36.40],
                     '90%_Percentile' : [55.0, 'NaN', 'NaN', 'NaN', 94.4, -36.1], 
                     'Standar_Deviation' : [10.31, 'NaN', 'NaN', 'NaN', 0.57, 4.59],
                     'Inter_quartile_range' : [15.00, 'NaN', 'NaN', 'NaN', 0.91, 6.30]
                     })

In [94]:
bank

,nama_kolom,Mean,Median,Mode,75%_Percentile,90%_Percentile,Standar_Deviation,Inter_quartile_range
0,age,40.11,38.0,32,47.0,55.0,10.31,15.0
1,job,NaN,NaN,admin.,NaN,NaN,NaN,NaN
2,education,NaN,NaN,university.degree,NaN,NaN,NaN,NaN
3,contact,NaN,NaN,cellular,NaN,NaN,NaN,NaN
4,cons.price.idx,93.57,93.74,93.99,93.99,94.4,0.57,0.91
5,cons.conf.idx,-40.49,-41.8,-36.4,-36.4,-36.1,4.59,6.3

**FINISHED**